{
  "experiences": [
    {
      "title": "Software Developer",
      "company": "Compassion AI",
      "location": "Chicago, United States",
      "date": "Jun 2024 - Nov 2024",
      "description": [
        "Introduced key-set pagination in FastAPI endpoints and optimized DynamoDB query filters to improve database efficiency.",
        "Implemented Global Secondary Indexes (GSI) in DynamoDB, accelerating data access performance and reducing latency.",
        "Architected a resilient, distributed file ingestion system leveraging multipart S3 uploads, presigned URLs, and S3 Transfer Acceleration to enhance global upload efficiency and reliability.",
        "Lowered monthly transcription costs by replacing AWS Transcribe with an in-house speech-to-text engine (containerized on EC2 and leveraging advanced NLP/acoustic modeling).",
        "Cut report generation time by implementing AWS Step Functions to parallelize AWS Lambda functions.",
        "Fine-tuned an open-source LLM for speech emotion recognition using Librosa-extracted features like pitch and MFCC, achieving high accuracy in emotion classification."
      ]
    },
    {
      "title": "Software Engineer",
      "company": "Capgemini",
      "location": "Mumbai, India",
      "date": "Feb 2022 - Aug 2023",
      "description": [
        "Decomposed a legacy monolith into Spring Boot microservices with RESTful APIs and centralized config management, enabling independent deployments and reducing release cycle times.",
        "Integrated Apache Kafka to enable decoupled real-time pipelines and asynchronous communication between microservices.",
        "Leveraged gRPC for efficient inter-service communication between microservices.",
        "Implemented rate limiting to manage API traffic and reduce error rates during spikes.",
        "Enhanced web application security with JWT-based authentication and OAuth 2.0 using Spring Security, reducing unauthorized access attempts.",
        "Implemented Docker containerization deployed via AWS ECS, enabling rapid autoscaling to handle high traffic and reducing deployment time."
      ]
    },
    {
      "title": "Machine Learning Intern",
      "company": "GVPCE",
      "location": "Visakhapatnam, India",
      "date": "May 2021 - May 2022",
      "description": [
        "Led a research team of 4 in developing innovative deep learning frameworks (LWCAR-Net, MCSAR-Net) for medical image segmentation.",
        "Implemented novel deep learning architectures with components like Context Segment Modules and Feature Synthesizers to enhance multiscale feature extraction and improve true positive rates in medical imaging.",
        "Designed lightweight deep learning models that significantly reduce computational overhead while maintaining high performance, improving diagnostic efficiency.",
        "Achieved clinical-grade accuracy for medical imaging applications, significantly reducing false negatives and enhancing early diagnosis of critical conditions."
      ]
    }
  ]
}
